begin;

insert into
    hotel (name, city, address, stars)
values
    ('Невский', 'Санкт-Петербург', 'Невский пр., 1', 5),
    ('Уют', 'Москва', 'ул. Тверская, 15', 3),
    ('Морской бриз', 'Сочи', 'Курортный пр., 42', 4);

insert into
    room_type (name, capacity)
values
    ('Standard', 2),
    ('Single', 1),
    ('Deluxe', 3),
    ('Suite', 4);

insert into
    room (
        hotel_id,
        room_type_id,
        room_number,
        price_per_night
    )
values
    (1, 3, '101', 12000.00),
    (1, 4, '501', 35000.00),
    (1, 1, '102', 8000.00),
    (2, 1, '101', 4500.00),
    (2, 2, '102', 3500.00),
    (2, 3, '201', 7000.00),
    (3, 1, '10', 6000.00),
    (3, 4, '12', 18000.00);

insert into
    guest (full_name, passport, email, phone)
values
    (
        'Иванов Иван Иванович',
        '4510 123456',
        'ivanov@mail.ru',
        '+79161234567'
    ),
    (
        'Петрова Анна Сергеевна',
        '4012 654321',
        'petrova@yandex.ru',
        '+79217654321'
    ),
    (
        'Смирнов Алексей Петрович',
        '4603 111222',
        'smirnov@gmail.com',
        '+79031112233'
    ),
    (
        'Кузнецова Мария Олеговна',
        '4518 333444',
        null,
        '+79265554433'
    ),
    (
        'Соколов Дмитрий Андреевич',
        '4020 777888',
        'sokolov@mail.ru',
        '+79119998877'
    );

insert into
    booking (
        guest_id,
        room_id,
        check_in,
        check_out,
        guests_count,
        price_per_night,
        status
    )
values
    (
        1,
        1,
        '2026-08-01',
        '2026-08-05',
        2,
        12000.00,
        'completed'
    ),
    (
        2,
        1,
        '2026-08-05',
        '2026-08-08',
        1,
        12000.00,
        'completed'
    ),
    (
        3,
        3,
        '2026-09-10',
        '2026-09-12',
        2,
        8000.00,
        'completed'
    ),
    (
        4,
        4,
        '2026-10-01',
        '2026-10-07',
        2,
        4500.00,
        'confirmed'
    ),
    (
        5,
        4,
        '2026-10-03',
        '2026-10-05',
        1,
        4500.00,
        'cancelled'
    ),
    (
        1,
        6,
        '2026-11-10',
        '2026-11-15',
        3,
        7000.00,
        'pending'
    ),
    (
        5,
        7,
        '2026-08-20',
        '2026-08-27',
        2,
        6000.00,
        'completed'
    ),
    (
        2,
        8,
        '2026-12-28',
        '2027-01-03',
        4,
        18000.00,
        'confirmed'
    );

insert into
    payment (booking_id, amount, method, paid_dt)
values
    (1, 48000.00, 'card', '2026-07-20 14:05+03'),
    (2, 10000.00, 'card', '2026-07-25 10:00+03'),
    (2, 26000.00, 'cash', '2026-08-05 13:30+03'),
    (3, 16000.00, 'cash', '2026-09-10 15:10+03'),
    (4, 9000.00, 'card', '2026-09-15 09:45+03'),
    (7, 42000.00, 'card', '2026-08-20 16:00+03'),
    (8, 30000.00, 'card', '2026-09-01 11:20+03');

commit;